Revit 2027 API
ParameterTypeId.FabricationProductDataMaterialDescription Property
 "Product Material Description"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationProductDataMaterialDescription { get; }
Public Shared ReadOnly Property FabricationProductDataMaterialDescription As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationProductDataMaterialDescription {
	ForgeTypeId^ get ();
}
static member FabricationProductDataMaterialDescription : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace